Словарь/src/Catalogs/Слоги/Слоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Слоги</name>
  <attributes>
    <name>НаименованиеНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьХираганой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьКатаканой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Моджи</name>
      <type>
        <types>CatalogRef.Моджи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКатакана</name>
    <attributes>
      <name>Моджи</name>
      <type>
        <types>CatalogRef.Моджи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/Catalogs/Слоги/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	ЗаполнитьЗаписьКаной();
КонецПроцедуры

Процедура ЗаполнитьЗаписьКаной()
	ЗаписьХираганой = "";
	Для Каждого СтрокаТЧ Из Состав Цикл
		
		ЗаписьХираганой = ЗаписьХираганой + СтрокаТЧ.Моджи.ЮникодПредставление;
		
	КонецЦикла;
	
	ЗаписьКатаканой = "";
	Для Каждого СтрокаТЧ Из СоставКатакана Цикл
		
		ЗаписьКатаканой = ЗаписьКатаканой + СтрокаТЧ.Моджи.ЮникодПредставление;
		
	КонецЦикла;
	
	
КонецПроцедуры
